[
  {
    "id": "6d558351-c077-416a-90ec-b303aea58173",
    "title": "Chief Financial Officer",
    "department": "Finance",
    "location": "New Delhi, India",
    "type": "Full-time",
    "experience": "5+ years",
    "description": "The ideal candidate will possess a strong background in finance, accounting, and business processes, coupled with exceptional leadership and communication skills.\r\nWe are seeking an experienced and driven Finance Controller to join our dynamic team.\r\nThe Finance Controller will play a pivotal role in overseeing and optimizing financial operations, ensuring accurate financial reporting, analyzing performance metrics, and providing strategic insights to facilitate informed decision-making.\r\nThe candidate having experience of Fund raising via VC or listing would be preferred.",
    "responsibilities": "Prepare accurate and timely financial statements, including income statements, balance sheets, and cash flow statements.\r\nConduct variance analysis to highlight key performance drivers and discrepancies against budget and forecasts.\r\nInterpret financial data to provide actionable insights for improving financial performance.\r\nCollaborate with cross-functional teams to develop annual budgets and long-term financial forecasts.\r\nMonitor budget performance, identifying areas for improvement and cost-saving opportunities. Adjust forecasts based on changing market conditions, operational developments, and external\r\nEstablish and maintain robust internal controls to ensure financial accuracy and mitigate risks. Ensure compliance with relevant accounting standards, tax regulations, and industry-specific",
    "requirements": "Coordinate with internal and external auditors to facilitate smooth audit processes.\r\nAnalyse costs, including direct and indirect costs, overheads, and cost of goods sold.\r\nProvide insights into cost-effective strategies, process improvements, and resource allocation. Collaborate with production teams to optimize cost structures while maintaining quality\r\nOversee inventory tracking, valuation, and reconciliations to maintain accurate inventory records.\r\nImplement inventory control procedures to minimize waste, obsolescence, and stockouts. Monitor inventory turnover ratios and recommend adjustments as necessary.\r\nProvide strategic financial guidance to senior management for informed decision-making and growth initiatives.\r\nAssess investment opportunities, capital allocation, and potential acquisitions from a financial perspective.\r\nAssist in evaluating the financial impact of strategic decisions and business expansion.\r\nLead, mentor, and develop a team of finance professionals, fostering a collaborative and high-performance culture.\r\nSet performance goals, conduct regular performance reviews, and provide coaching and feedback.",
    "qualifications": "Bachelor’s degree in finance, Accounting, Business Administration, or a related field; CA preferred.\r\nProven experience (5+ years) in finance roles . In-depth understanding of business processes, cost accounting, and inventory\r\nProficiency in financial software, ERP systems, and advanced MS Excel skills.\r\nStrong analytical and problem-solving abilities, with a keen attention to detail. Excellent communication and interpersonal skills to liaise effectively with cross-functional team\r\nAbility to thrive in a fast-paced, dynamic environment and manage multiple priorities. Demonstrated track record of driving process improvements and operational efficiencies.",
    "benefits": "",
    "createdAt": "2025-07-05T10:48:31.959Z",
    "status": "active"
  },
  {
    "id": "a4f2d959-ffbe-408c-b105-62b6ce907a85",
    "title": "Assistant Manager ",
    "department": "Sales",
    "location": "Mumbai & Chennai, India",
    "type": "Full-time",
    "experience": "2-6 years",
    "description": "Assistant Sales Manager shall be reporting to Sales Manager of Vardhman and he shall be responsible for all Government , Private market in India which includes , Green/Brown field Airports/airbases/airstrips/ helipads and all landside business , he shall be working with Sr. Sales Manager and sales support team for sharing the responsibilities. He shall be focusing on , develop and drive Airfield Ground Lighting (AGL) , Control Monitoring System, Advance Visual Docking Guidance Systems (AVDGS) , GOS ( Gate Operating system, Photometric testing systems for AGL, Electrical low voltage Systems (HVAC IBMS, Alarm, CCTV, Access Control) business in India. He shall be point of contact for all Private and Government customers for all related technical and commercial queries.",
    "responsibilities": "Supervision of the entire techno-commercial value chain i.e. meeting customers, understanding their requirements, working on tenders, specking the tenders, working with airport consultants, end customers and contractors, giving inputs to sales support team in preparing technical and price bids, attending bid meetings, finalizing technical and commercial terms and negotiating with vendors and customers to become L1.\r\nCementing healthy customer relations with all departments at various levels for resolving problems or responding to enquiries with focus on the importance of exceeding customer requirements and maintained a satisfied customer base in India for continued business.\r\nDevelop a pipeline by involving at pre-bid stage before the release of tenders\r\nRegular visits to all stakeholders of customers, arrange presentations in Airport and Defense customers\r\nInfluence on specifications of tenders\r\nExperience in Handling Govt departments, Green/Brown field airports, LSTK, Consultants, Electrical Contractors and Projects in Airports and Defense\r\nFrequent travelling within India\r\nWeekly / monthly /Quarterly reporting on Targets to Sales director",
    "requirements": "B.E/Diploma in Electrical/Electronics / Computer Science Engineering\r\nAn ideal candidate should have 2 to 6 years of work experience on Sales of airfield lighting system, Control Monitoring Systems, Visual Docking Guidance System, ELV and security systems.",
    "qualifications": "Hands on experience of working on Airports and should be aware of basic principles & components of Airfield lighting Systems, VDGS, ELV and security systems.\r\nExposed to the criteria’s for design of the visual aids including the airfield ground lighting (AGL) systems, in accordance with Standards and Recommendations in ICAO, Annex 14, Aerodrome Design and Operations, and with ICAO´s Aerodrome Design Manual, Part 4: Visual Aids, and Part 5: Electrical installations and Civil Aviation Requirement ( CAR ) of DGCA/India.\r\nSkills to handle customers alone and final negotiations.\r\nExcellent Communication\r\nTarget oriented with a strong improvement reflex.\r\nCustomer satisfaction oriented Committed on results.\r\nGood Working Knowledge on Windows, Microsoft Office (Specially in Excel), Microsoft teams",
    "benefits": "",
    "createdAt": "2025-07-05T10:53:51.568Z",
    "status": "active"
  },
  {
    "id": "9e14f9b2-21a5-4418-9643-b3928cb83bcc",
    "title": "Electronic Engineer",
    "department": "Electronics",
    "location": "Delhi, India",
    "type": "Full-time",
    "experience": "2-5 years",
    "description": "Coordinate with vendors for component /PCB/microcontroller for technical specifications.\r\nShould be able to do testing and validation of product. Should be aware of general electronics concepts.\r\nHaving sound understanding of Integrated Circuits, Passive and Active Components.\r\nShould be having past experience from electronics manufacturing or Lighting Industries.\r\nShould be able to define/perform/verify quality check on electronics component.\r\nTroubleshooting\r\nCandidate should have Knowledge about PCB Designing tools & able to simulate the circuit.",
    "responsibilities": "Our company is currently looking for a dynamic, self-motivated Electronic Engineer to maintain and support our Airports solutions products, systems and engineering function. \r\nThe Electronic Engineer will work across a variety of functional groups that are directly involved in engineering, product development, Testing, Project implementation, and international contract manufacturing partners. The ideal candidate is an inventive problem solver that is capable of working through technical challenges and employing pragmatic solutions. This is a fantastic opportunity to join a team that provides integrated services to meet our clients’ needs.\r\nThe company is promoted by industry veterans and is growing rapidly and offer ample growth opportunity. Salary & remuneration will not be a constraint for right candidate.",
    "requirements": "Well versed in handling computers and MS office, MS projects\r\nPossess excellent analytical, Communication (Written & Verbal) & problem-solving abilities.\r\nDetail oriented and organized in work.\r\nAbility to work cooperatively and collaboratively with all levels of employees, management, and external customers.\r\nAbility to effectively organize and structure activities on daily basis, prioritize and manage multiple tasks simultaneously and work to a deadline.\r\nSelf-motivated, proactive, with a desire to learn/grow.",
    "qualifications": "Engineer have knowledge about - draft schematics, design analysis & calculations, BOM creation, component qualification and costing, de-rating analysis and documentation, design capabilities on analog, digital including microcontroller and power section, inventory management, Test Jig and development setup support, creating verification and validation documents, board level testing and troubleshooting, board/system bring up and testing board validation and verification.\r\nShould have Knowledge about PCB design (schematic to Gerber) and simulation tools.\r\nHaving sound understanding of Integrated Circuits, Passive and Active Components.\r\nShould be able to understand THD, PF, Efficiency, IR, Dielectric breakdown, ESD protection, EMI and EMC.\r\nKnowledge of steps involved in PCB manufacturing\r\nCircuit troubleshooting and finding fault using multimeter.\r\nShould be able to solder and desolder components from PCB",
    "benefits": "",
    "createdAt": "2025-07-05T10:56:55.648Z",
    "status": "active",
    "updatedAt": "2025-07-05T10:59:07.616Z"
  },
  {
    "id": "492913a4-6291-4020-b3f9-2a2ca28eddbf",
    "title": "Sales Manager- Airports & Defense",
    "department": "Sales",
    "location": "New Delhi, India",
    "type": "Full-time",
    "experience": "5+ years",
    "description": "Sales Manager shall be reporting to Sales Director of Vardhman and he shall be responsible for sales in Airports, (Airports Authority of India, DIAL, MIAL, BIAL, CIAL, Adani and upcoming new developers) & Defense (Military and Paramilitary forces like Military Engineering Services, Air Force, Navy, Army etc.) market in India which includes airports, airbases, airstrips and helipads. He shall be working with Sales Director and Sales support team leader for sharing the responsibilities. He shall be focusing on driving sales in Airfield Ground Lighting (AGL), Airfield Lighting Control Monitoring System, Advance Visual Docking Guidance Systems (AVDGS), GOS (Gate Operating system), Photometric testing, Air Traffic Management, Communication and Navigational Equipment, Electrical low voltage systems and security systems business in India, He shall be a point of contact for all airport, defence and government customers for all related technical and commercial discussions.",
    "responsibilities": "Supervision of the entire techno-commercial value chain i.e. meeting customers, understanding their requirements, working on tenders, specking the tenders, working with end customers and contractors, giving inputs to sales support team in preparing technical and price bids, attending bid meetings, finalizing technical and commercial terms and negotiating with vendors and customers to become L1.\r\nCementing healthy customer relations with all departments at various levels for resolving problems or responding to enquiries with a focus on the importance of exceeding customer requirements and maintaining a satisfied customer base in India for continued business.\r\nExcellence in offering and optimizing a complete range of solutions and services to valued clientele, investigating new business opportunities, maximizing its competitive strength for long-term success\r\nDevelop a pipeline by involving at a pre-bid stage before the release of tenders\r\nRegular visits to all stakeholders of customers, arrange presentations in Airport and Defense customers\r\nInfluence on specifications of tenders\r\nCoordinate with all internal stakeholders to ensure competitive bid\r\nExperience in Handling Govt departments, defence personnel at various levels\r\nFrequent travelling within India\r\nWeekly / monthly /Quarterly reporting on targets to Sales director",
    "requirements": "B.E/Diploma in Electrical/ Electronics/ Computer Science Engineering\r\nAn ideal candidate should have 5+ years of work experience in Sales of an airfield lighting system, electrical substation, Control Monitoring System, Advanced Visual Docking Guidance System (AVDGS) and constant current regulators and Extra Low Voltage (ELV) systems.\r\nExperience in Airports and is aware of basic principles & components of Airport Terminal/Landside solutions (ELV-HVAC IBMS, CCTV, ACS, FAS, FIDS, PAVA, BHS, X-ray, Body scanners, Automatic tray retrieval systems, CUSS, CUPS, Self-check-in, Kiosks), Airside solutions (Visual Aids-Airfield lighting Systems/AGL & Advanced Visual Docking Guidance Systems/AVDGS, PBB, Crash Fire, Runway Surface Friction Tester, Runway Rubber Removal Vehicle, GPU, PCA), ATM solutions (ATFMS, ASR/ MSSR/SMR, VCS, AMHS, AFIS, ASMGCS, VHF Tx/Rx (Radio), Digital Voice Tape Recorder (DVTR), Nav-Aids - DME, ILS, D-VOR, NDB), Cityside solutions (Perimeter intrusion detection systems, Parking solutions, Automatic Storage & Retrieval System, Cargo Handling Solutions, Gate management systems, UVSS, Bollard, Tyre Killers, Wedge barriers and integrated security solutions)\r\nSales skills to handle customers alone and final negotiations\r\nKnowledge of International standards and recommendations in ICAO Annex-14, Aerodrome Design and Operations and with ICAO´s Aerodrome Design Manual, Part 4: Visual Aids, and Part 5: Electrical installations and Civil Aviation Requirement (CAR) of DGCA-India.\r\nExcellent oral and written communication\r\nTarget oriented with a strong improvement reflex.\r\nCustomer satisfaction oriented Committed to results.\r\nSelf-motivated, self-learner and passionate about driving sales\r\nAbility to handle a team of sales team members\r\nExposure to the criteria for the design of the visual aids including the airfield ground lighting (AGL) systems and AVDGS shall be an added advantage\r\nDemonstrates a well-developed sense of the industry and market trends in their given geography\r\nDepth of knowledge of our customers’ businesses and drivers in Airports\r\nExceptional knowledge of sales process and systems to drive consistent business results\r\nKnowledge of terms and conditions of tenders, contracts like GCC, SCC, LD, payment terms, PQ terms, MOU, MAF, etc\r\nGood Working Knowledge of Windows, Microsoft Office, CRM Tools, Collaborative tools (Microsoft teams).",
    "qualifications": "Operational Analysis – The ability to obtain relevant information on operational issues from multiple sources, think broadly about those issues and recognize trends/possible cause-effect relationships.\r\nDecision Making - The ability to make considered and effective decisions and take clear action to address issues.\r\nExecution - The ability to mobilize resources and develop and implement action plans/control mechanisms to achieve desired results and deliver on commitments.\r\nRisk Management - The ability to understand the implications and assess the appropriate degree of acceptable risk and take actions to minimize risk.\r\nCustomer Relationship Management - The ability to build and maintain effective relationships with customers based on trust and mutual understanding.\r\nCoaching and Developing Others - The ability to enhance the performance of individuals and teams through setting challenging performance standards, providing constructive feedback on performance and collaboratively discussing improvement strategies.\r\nInfluencing/Persuasion - The ability to gain other people's buy into a course of action by communicating ideas with conviction, selling the benefits of the proposal and using compelling logic.\r\nCommunication - The ability to engage employees by providing relevant information on time using clear and compelling messages and by listening to and valuing input from employees.\r\nDrive for Results - The ability to demonstrate energy and determination to achieve results and improvement by overcoming obstacles, remaining effective despite setbacks and challenging current thinking. ",
    "benefits": "",
    "createdAt": "2025-07-14T05:17:59.798Z",
    "status": "active"
  },
  {
    "id": "ce441a22-3007-4e14-af11-c9b72c52e7b3",
    "title": "AM/Sales Support Manager-Airports",
    "department": "Sales",
    "location": "New Delhi, India",
    "type": "Full-time",
    "experience": "8+ years",
    "description": "The Sales Support Manager will report to the Sales Director for Airports Business. He would be responsible for the provision of support for any airside (visual aids, etc), ATM (nav aids, etc.), landside (ELV system, etc) and City Side (PIDS, integrated security, etc.) solutions at airports from a Bid Preparation, Estimation, Proposal writing, collateral, bid analysis, director’s approval’s perspective from bids of value from 1 Cr to 30 Cr.\r\n\r\nYou will be responsible of the delivery of the high quality Solutions and Bid Proposals on time, and in line with Vardhman standards of quality.",
    "responsibilities": "Estimating Support / Monitoring: will manage the estimation/sales support team for Airport vertical and support Sales Manager in Airport Business bid process, bid/no bid, OEM identification, solution design, estimation, review, competitive comparison, review accurate estimate, compliance statements from OEMs, quotes from 3rd party vendors, contractual obligations, interfaces with procurement for obtaining negotiated quotes, ensures completeness of bid document, e-bid preparation and submission (uploading and downloading documents), reverse auction bidding for customers (Airport Authorities, Airport developers) like AAI, DIAL, MIAL, BIAL, CIAL, LSTK and Electrical Contractors, etc.\r\nFacilitating competitive strategy planning to management, drive key initiatives with sales professional network effectively to ensure Vardhman response is accurate, identifies Vardhman’s value proposition.\r\nTo be successful you will need to be very well organized, with sound project management skills, able to work within a team.\r\n\r\n",
    "requirements": "B.tech/B.E/Diploma in Electrical/Electronic / Computer Science Engineering\r\nEight (8) + years of related experience.\r\nExperience on Airports and is aware of basic principles & components of\r\nAirport Airside solutions (Visual Aids-Airfield lighting Systems/AGL & Advanced Visual Docking Guidance Systems/AVDGS, PBB, Crash Fire, Runway Surface Friction Tester, GPU, PCA, Runway maintenance equipment.\r\nTerminal/Landside solutions- ELV-CCTV, ACS, FAS, FIDS, PAVA, BHS, X ray, Body scanners, Automatic tray retrieval systems, CUSS, CUPS, Self checkin, Kiosks\r\nATM solutions- ATFMS, ASR/ MSSR/SMR, VCS, AMHS, AFIS, ASMGCS, VHF Tx/Rx (Radio), Digital Voice Tape Recorder (DVTR), Nav-Aids – DME, ILS, D-VOR , NDB.\r\nCity side solutions (Perimeter intrusion detection systems, Parking solutions, Automatic Storage & Retrieval System, Cargo Handling Solutions, Gate management systems, UVSS, Bollard, Tyre Killers, Wedge barriers and integrated security solutions.\r\nExperience giving proposals to end customers/LSTK/electrical contractors as per target price levels and meeting company’s minimum margins with value of bids from 1 Cr to 30 Cr.\r\nKnowledge of terms and conditions of tenders, contracts like GCC, SCC, LD, payment terms, PQ terms, MOU, MAF, etc.\r\nAbility to write technical specifications in the tenders\r\nProven ability to work on multiple bids/ opportunities at one time\r\nAbility to handle a team of sales support team members\r\nExcellent Contacts with global and local Suppliers in the market\r\nExposed to Standards and Recommendations of ICAO Annex 14, Aerodrome Design and Operations, ICAO´s Aerodrome Design Manual, Part 4: Visual Aid, ICAO Service Manual and FAA.\r\nDepth of knowledge of our customers’ businesses and drivers in Airports\r\nProactive approach and provide customers value engineered solutions and products that help meet the budget of the customers\r\nFinancial and business acumen; capable of creating unbudgeted opportunities funded from value of the solution or offering\r\nGood Working Knowledge on Windows, Microsoft Office, CRM Tools, Collaborative tools like Microsoft teams, etc.\r\nGood verbal and written communications skills\r\nThe position may require occasional traveling (50%) to customer location for requirement gathering & meetings.",
    "qualifications": "Operational Analysis – The ability to obtain relevant information on operational issues from multiple sources, think broadly about those issues and recognize trends/possible cause-effect relationships.\r\nDecision Making – The ability to make considered and effective decisions and take clear action to address issues.\r\nExecution – The ability to mobilize resources and develop and implement action plans / control mechanisms to achieve desired results and deliver on commitments.\r\nRisk Management – The ability to understand the implications and assess the appropriate degree of acceptable risk and take actions to minimize risk.\r\nCustomer Relationship Management – The ability to build and maintain effective relationships with customers based on trust and mutual understanding.\r\nCoaching and Developing Others – The ability to enhance the performance of individuals and teams through setting challenging performance standards, providing constructive feedback on performance and collaboratively discussing improvement strategies.\r\nInfluencing/Persuasion – The ability to gain other people’s buy in to a course of action by communicating ideas with conviction, selling the benefits of the proposal and using compelling logic.\r\nCommunication – The ability to engage employees by providing relevant information in a timely manner using clear and compelling messages and by listening to and valuing input from employees.\r\nDrive for Results – The ability to demonstrate energy and determination to achieve results and improvement by overcoming obstacles, remaining effective despite setbacks and challenging current thinking.",
    "benefits": "",
    "createdAt": "2025-07-14T05:19:45.635Z",
    "status": "active",
    "updatedAt": "2025-07-14T05:24:20.107Z"
  },
  {
    "id": "c537984c-7d68-4119-b053-9c92752c50f6",
    "title": "EHS Assistant Manager",
    "department": "Managing",
    "location": "New Delhi, India",
    "type": "Full-time",
    "experience": "2-4 years",
    "description": "EHS Assistant Manager will manage all safety parameter in Airfield ground Lighting projects independently.",
    "responsibilities": "",
    "requirements": "To assist the management and department about safety.\r\nTo implement the legislation in respect of occupational safety & health.\r\nSafety officer will take care of all workers in the organization and as well as on site.\r\nEnvironmental health and safety managers inspect and evaluate the environment, equipment, and processes in working areas to ensure compliance with government safety regulations and industry standards.\r\nConduct training and presentations for health and safety matters and accident prevention\r\nInspect equipment and machinery to observe possible unsafe conditions\r\nReport on health and safety awareness, issues, and statistics\r\nDevelops health and safety procedures for all areas of the company.\r\nMonitoring health and safety risks and hazards in the workplace\r\nFirst aid / nursing duties.\r\nOffering general health and safety advice to all employees\r\nSafety officer have authority to stop any operational work or other activity which puts people to risk of injury.\r\nAlways ensure the company is prepared to submit all the relevant health and safety documents.\r\nProvide information on environmental relevance by preparing charts, graphs, and presentations\r\nResource planning as per site requirement\r\nMaintain site attendance, working days, working hours, leaves data, and keep as records\r\nTo check the daily attendance of the project site workforce/contractors/sub-contractor/labours and prepare the time sheet",
    "qualifications": "Bachelor`s degree in Environmental Health & Safety Or any equivalent degree with 2-4 years of relevant experience.",
    "benefits": "",
    "createdAt": "2025-07-14T05:26:41.243Z",
    "status": "active"
  },
  {
    "id": "0c468f6e-e855-46c7-adac-cff8063634df",
    "title": "Senior Engineer- Product Development (Mechanical)",
    "department": "Mechanical",
    "location": "New Delhi, India",
    "type": "Full-time",
    "experience": "2-5 years",
    "description": "Our company is currently looking for a dynamic, self-motivated Mechanical Engineer to maintain and support our airports solutions products, systems and engineering function. The Mechanical Engineer will work across a variety of functional groups that are directly involved in engineering, product development, Project implementation, and international contract manufacturing partners. The ideal candidate is an inventive problem solver that is capable of working through technical challenges and employing pragmatic solutions. This is a fantastic opportunity to join a team that provides integrated services to meet our clients’ needs.\r\n\r\nThe company is promoted by industry veterans and is growing rapidly and offer ample growth opportunity. Salary & remuneration will not be a constraint for right candidate.",
    "responsibilities": "Design the 2D and 3D models as per the requirement and inputs of manager.\r\nCoordinate with vendors to implement the design and development of the product in the set timeline\r\nDevelop the prototype\r\nTest and validate for mechanical specifications of new products.\r\nPrepare BOM for cost estimation.\r\nPrepare specification Sheet and Test SOP for all new products in product line.\r\nProject planning and maintain track report of new product development stages.\r\nThird party testing",
    "requirements": "Diploma / Degree in Mechanical with knowledge in providing solution for Airports. Preference would be given to candidates having experience of Airfield lighting system, Visual docking guidance system, ASMGCS, Airports engineering and maintenance. Candidate should have relevant experience of 2 to 3 years.\r\nB.Tech (Mechanical) with 2 to 5 years of relevant experience\r\nExposure to LED light design and development.\r\nExposure of working with Vendors and developing prototyping.\r\nWorking knowledge of 2D and 3D CAD software.\r\nUnderstanding of Die casting, molding & Extrusion processes and should have relevant experience\r\nGood Communication and Email skills.",
    "qualifications": "Well versed in handling computers and MS office, MS projects\r\nPossess excellent analytical, Communication (Written & Verbal) & problem-solving abilities.\r\nDetail oriented and organized in work.\r\nAbility to work cooperatively and collaboratively with all levels of employees, management, and external customers.\r\nAbility to effectively organize and structure activities on daily basis, prioritize and manage multiple tasks simultaneously and work to a deadline.\r\nSelf-motivated, proactive, with a desire to learn/grow.",
    "benefits": "",
    "createdAt": "2025-07-14T05:29:42.248Z",
    "status": "active"
  },
  {
    "id": "1bd2dda8-fb24-43c5-b3be-87cac90d9598",
    "title": "\tDesign Engineer / Senior Design Engineer",
    "department": "Operations",
    "location": "New Delhi, India",
    "type": "Full-time",
    "experience": "3+ years",
    "description": "Incumbent will be responsible for designing of the airport related projects including runways, taxiways, aprons, airfield lighting, control monitoring system substation layout, VDGS layout, Cable routing layout, earthing design etc. He shall be responsible to prepare GA/GFC drawings, Single line diagram, Installation drawings, and Preparation of engineering design reports along with design basis report, detail design report. He shall also have sound knowledge for designing Guidance Sign Boards and CCRs requirements. He shall be comparing the BOQ vs drawing provided by client/ consultant considering ICAO, FAA, CAR, and global and local standards prevailing in market. Also, he should be owning responsibility of building electrical drawing by using appropriate Symbols, abbreviation, Legend as per international and domestic standards.",
    "responsibilities": "",
    "requirements": "Excellent verbal and written communication skills\r\nProficiency in AutoCAD, and Microsoft Office\r\nAbility to coordinate multiple project tasks\r\nSelf-motivated and able to handle a fast-paced position\r\nKnowledge of ICAO, FAA, IES recommendation, preparation of BOQ for AGL is an essential requirement.\r\nStrong knowledge of electrical equipment and their symbol as per international standard.\r\nFirm knowledge of electrical safety rules.\r\nAble to understand and calculate electrical circuits Loads.\r\nStrong knowledge and experiences on electrical power supply and distribution.",
    "qualifications": "B.E/Diploma in Electrical/Electronic Engineering + CAD specialist with minimum 3 years’ experience on designing of any international airports.\r\nKnowledge of ICAO, FAA, IES recommendation, preparation of AGL, GFC drawing, and their power supply layout plans is an essential requirement.",
    "benefits": "",
    "createdAt": "2025-07-14T05:31:58.609Z",
    "status": "active"
  },
  {
    "id": "120693ea-4947-4cc6-a77b-89119960b127",
    "title": "Embedded Electronic Engineer",
    "department": "Electronics",
    "location": "New Delhi, India",
    "type": "Full-time",
    "experience": "2-5 years",
    "description": "Our company is currently looking for a dynamic, self-motivated Electronic Engineer to maintain and support our airports solutions products, systems and engineering function. The Electronic Engineer will work across a variety of functional groups that are directly involved in engineering, product development, Testing, Project implementation, and international contract manufacturing partners. The ideal candidate is an inventive problem solver that can work through technical challenges and employing pragmatic solutions. This is a fantastic opportunity to join a team that provides integrated services to meet our clients’ needs.\r\n\r\nThe company is promoted by industry veterans and is growing rapidly and offer ample growth opportunity. Salary & remuneration will not be a constraint for right candidate.",
    "responsibilities": "Firmware designing.\r\nSupport in development of electronic drivers by making products as per prescribed design files.\r\nCoordinate with vendors for component /microcontroller for technical specifications.\r\nShould be able to do testing and validation of product. Should be aware of general electronics\r\nExperience in Static code analysis such as C/C++.\r\nGood knowledge of software and application design, design patterns.\r\nExperience in unit testing, component testing.\r\nUnderstanding about Embedded concepts (like HW/SW interfacing, drivers, RTOS).\r\nKnowledge of operating systems applied in embedded systems.\r\nHands on Modelling tools like Rhapsody, Enterprise architect etc. would be added advantage\r\nExperience in configuration and version management tools (SVN, Git).",
    "requirements": "Core skills – C, C++ and Embedded C.\r\nGood Exposure to Microcontroller based platforms.\r\nAnalyse the system requirements and derive the software requirements.\r\nExcellent knowledge and programming skill in C, C++ and Embedded C.\r\nGood exposure to automation tools and scripts.\r\nCreate the high-level design and low-level design.\r\nGood exposure to SW compiler and Debugger.\r\nKnowledge of communication protocols like 232, 485, I2C, CAN, BUS.\r\nWork experience of controllers STM32, PIC and 8051.",
    "qualifications": "Well versed in handling computers and MS office, MS projects\r\nPossess excellent analytical, Communication (Written & Verbal) & problem-solving abilities.\r\nDetail oriented and organized in work.\r\nAbility to work cooperatively and collaboratively with all levels of employees, management, and external customers.\r\nAbility to effectively organize and structure activities on daily basis, prioritize and manage multiple tasks simultaneously and work to a deadline.\r\nSelf-motivated, proactive, with a desire to learn/grow.",
    "benefits": "",
    "createdAt": "2025-07-14T05:34:04.419Z",
    "status": "active",
    "updatedAt": "2025-07-17T05:47:36.719Z"
  }
]