[
  {
    "id": "1751646703011",
    "title": "sample",
    "description": "this is sample post 1",
    "content": "Ultra-Slim. Ultra-Efficient. The New Standard in Airfield Signage. ✈️\r\nIntroducing our ultra-slim edge-lit sign boards, crafted with a profile of less than 45 mm — a seamless blend of innovation, aesthetics, and engineering built to outperform conventional signage.\r\n\r\n🔍 Why airports are making the switch to edge-lit technology:\r\n\r\n✅ Sleek and space-saving design – ideal for modern infrastructure upgrades\r\n✅ Better heat management – edge lighting minimizes thermal hotspots, extending LED lifespan\r\n✅ Lower power consumption – improved energy efficiency with optimal brightness\r\n✅ Uniform ICAO-compliant brightness – clearer visibility in all weather conditions\r\n✅ Reduced maintenance – fewer components, faster servicing\r\n✅ Modern, elegant appearance – enhances the airside environment\r\n\r\n🚧 Completed Projects Include:",
    "author": "aryan kansal",
    "createdAt": "2025-07-04T16:31:43.011Z",
    "pdfFile": "1751646703002-507550672.pdf",
    "updatedAt": "2025-07-17T05:48:41.856Z"
  },
  {
    "id": "1751646816166",
    "title": "sample post 2",
    "description": "sample post 2 description",
    "content": "Introducing Vardhman's Indigenous ALCMS for Mid to Small Airports\r\n\r\nAt Vardhman Airport Solutions (VAS), we champion the Make in India initiative with our cutting-edge Airfield Lighting Control and Monitoring Systems (ALCMS). Our PLC-based system, successfully deployed at Ahmedabad (2023), Aurangabad (2024), and Calicut (2025) airports, prioritizes operational efficiency, safety, and cost-effectiveness.\r\n\r\nKey Features of VAS ALCMS:\r\n\r\n- Innovative touchscreen interface for enhanced user experience\r\n- Reliable ON/OFF operations and brightness regulation through hardwired communication\r\n- ICAO compliance with diagnostics for % lamp failure and insulation resistance\r\n- Scalable future upgrades and minimal retraining for ATC teams\r\n- Robust service support for maintenance and advancements",
    "author": "aryan kansal",
    "createdAt": "2025-07-04T16:33:36.166Z",
    "pdfFile": "1751646816152-598027123.pdf"
  },
  {
    "id": "1751646874000",
    "title": "asdkfld",
    "description": "adj dda",
    "content": "aksknlfadvlkasev",
    "author": "ss",
    "createdAt": "2025-07-04T16:34:34.000Z",
    "pdfFile": "1752734813620-679902415.pdf",
    "updatedAt": "2025-07-17T06:46:53.646Z"
  },
  {
    "id": "1751961750638",
    "title": "sample today",
    "description": "disnvsivruirv",
    "content": "fieuwfrgewr",
    "author": "Yadul ",
    "createdAt": "2025-07-08T08:02:30.638Z",
    "pdfFile": "1751961750608-45581535.pdf"
  }
]